# Setup School District Data

In [ ]:
USE DATABASE WORLD_HISTORY;
CREATE SCHEMA IF NOT EXISTS SCHOOLS;
USE SCHEMA SCHOOLS;

In [ ]:
-- =====================================================================================
-- SCHOOL DISTRICTS DATABASE - NORMALIZED DESIGN
-- Stage 09: Create normalized tables for 5 biggest US cities school district data
-- =====================================================================================



-- School district data will be created directly in the public schema (no separate stage needed)

-- =====================================================================================
-- NORMALIZED TABLE STRUCTURES
-- =====================================================================================

-- 1. CITIES TABLE
-- Contains the 5 biggest US cities by population
CREATE OR REPLACE TABLE cities (
    city_id INTEGER,
    city_name VARCHAR(100),
    state VARCHAR(50),
    population INTEGER,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP()
);

-- 2. SCHOOL DISTRICTS TABLE  
-- Contains the largest school district in each city
CREATE OR REPLACE TABLE school_districts (
    district_id INTEGER,
    district_name VARCHAR(200),
    city_id INTEGER,
    total_students INTEGER,
    total_schools INTEGER,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP()
);

-- 3. HIGH SCHOOLS TABLE
-- Contains 3 high schools from each district (15 total)
CREATE OR REPLACE TABLE high_schools (
    school_id INTEGER,
    school_name VARCHAR(200),
    district_id INTEGER,
    school_type VARCHAR(50), -- Regular, Magnet, Charter, etc.
    enrollment INTEGER,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP()
);

-- 4. TEACHERS TABLE
-- Contains 3 world history teachers per school (45 total)
CREATE OR REPLACE TABLE teachers (
    teacher_id INTEGER,
    teacher_name VARCHAR(100),
    school_id INTEGER,
    subject VARCHAR(50),
    years_experience INTEGER,
    education_level VARCHAR(50),
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP()
);

-- 5. CLASSES TABLE
-- Contains 3 world history classes per school (45 total)
CREATE OR REPLACE TABLE classes (
    class_id INTEGER,
    class_name VARCHAR(100),
    teacher_id INTEGER,
    school_id INTEGER,
    period INTEGER,
    room_number VARCHAR(20),
    max_capacity INTEGER,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP()
);

-- 6. STUDENTS TABLE
-- Contains 30 students per class (1,350 total students)
CREATE OR REPLACE TABLE students (
    student_id INTEGER,
    student_name VARCHAR(100),
    class_id INTEGER,
    grade_level INTEGER,
    age INTEGER,
    gender VARCHAR(10),
    enrollment_date DATE,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP()
);

In [ ]:

-- =====================================================================================
-- DATA INSERTION
-- =====================================================================================

-- Insert Cities Data
INSERT INTO cities VALUES
(1, 'New York City', 'New York', 8500000, CURRENT_TIMESTAMP()),
(2, 'Los Angeles', 'California', 3900000, CURRENT_TIMESTAMP()),
(3, 'Chicago', 'Illinois', 2700000, CURRENT_TIMESTAMP()),
(4, 'Houston', 'Texas', 2300000, CURRENT_TIMESTAMP()),
(5, 'Phoenix', 'Arizona', 1700000, CURRENT_TIMESTAMP());

-- Insert School Districts Data
INSERT INTO school_districts VALUES
(1, 'New York City Department of Education', 1, 1100000, 1800, CURRENT_TIMESTAMP()),
(2, 'Los Angeles Unified School District', 2, 565000, 1300, CURRENT_TIMESTAMP()),
(3, 'Chicago Public Schools', 3, 330000, 650, CURRENT_TIMESTAMP()),
(4, 'Houston Independent School District', 4, 190000, 280, CURRENT_TIMESTAMP()),
(5, 'Phoenix Union High School District', 5, 28000, 22, CURRENT_TIMESTAMP());

-- Insert High Schools Data (3 per district)
INSERT INTO high_schools VALUES
-- NYC Schools
(1, 'Stuyvesant High School', 1, 'Specialized', 3300, CURRENT_TIMESTAMP()),
(2, 'Bronx High School of Science', 1, 'Specialized', 3000, CURRENT_TIMESTAMP()),
(3, 'Brooklyn Technical High School', 1, 'Specialized', 5400, CURRENT_TIMESTAMP()),

-- LA Schools  
(4, 'Garfield High School', 2, 'Regular', 2800, CURRENT_TIMESTAMP()),
(5, 'Hollywood High School', 2, 'Magnet', 2100, CURRENT_TIMESTAMP()),
(6, 'Lincoln High School', 2, 'Regular', 3200, CURRENT_TIMESTAMP()),

-- Chicago Schools
(7, 'Whitney Young Magnet High School', 3, 'Selective Enrollment', 2200, CURRENT_TIMESTAMP()),
(8, 'Lane Tech College Prep High School', 3, 'Selective Enrollment', 4400, CURRENT_TIMESTAMP()),
(9, 'Jones College Prep High School', 3, 'Selective Enrollment', 1800, CURRENT_TIMESTAMP()),

-- Houston Schools
(10, 'Bellaire High School', 4, 'Regular', 3600, CURRENT_TIMESTAMP()),
(11, 'Lamar High School', 4, 'Regular', 3100, CURRENT_TIMESTAMP()),
(12, 'Carnegie Vanguard High School', 4, 'Magnet', 1200, CURRENT_TIMESTAMP()),

-- Phoenix Schools
(13, 'Central High School', 5, 'Regular', 1800, CURRENT_TIMESTAMP()),
(14, 'Skyline High School', 5, 'Regular', 2400, CURRENT_TIMESTAMP()),
(15, 'Peoria High School', 5, 'Regular', 2900, CURRENT_TIMESTAMP());

-- Insert Teachers Data (3 world history teachers per school)
INSERT INTO teachers VALUES
-- NYC Teachers (Schools 1-3)
(1, 'Sarah Johnson', 1, 'World History', 12, 'Masters', CURRENT_TIMESTAMP()),
(2, 'Michael Chen', 1, 'World History', 8, 'Masters', CURRENT_TIMESTAMP()),
(3, 'Rebecca Martinez', 1, 'World History', 15, 'Masters', CURRENT_TIMESTAMP()),
(4, 'David Thompson', 2, 'World History', 10, 'Masters', CURRENT_TIMESTAMP()),
(5, 'Lisa Wang', 2, 'World History', 6, 'Bachelors', CURRENT_TIMESTAMP()),
(6, 'James Rodriguez', 2, 'World History', 14, 'Masters', CURRENT_TIMESTAMP()),
(7, 'Amanda Foster', 3, 'World History', 9, 'Masters', CURRENT_TIMESTAMP()),
(8, 'Robert Kim', 3, 'World History', 11, 'Masters', CURRENT_TIMESTAMP()),
(9, 'Jennifer Lopez', 3, 'World History', 7, 'Bachelors', CURRENT_TIMESTAMP()),

-- LA Teachers (Schools 4-6)
(10, 'Carlos Gutierrez', 4, 'World History', 13, 'Masters', CURRENT_TIMESTAMP()),
(11, 'Michelle Davis', 4, 'World History', 5, 'Bachelors', CURRENT_TIMESTAMP()),
(12, 'Anthony Wilson', 4, 'World History', 16, 'Doctorate', CURRENT_TIMESTAMP()),
(13, 'Maria Hernandez', 5, 'World History', 8, 'Masters', CURRENT_TIMESTAMP()),
(14, 'Kevin Park', 5, 'World History', 12, 'Masters', CURRENT_TIMESTAMP()),
(15, 'Rachel Green', 5, 'World History', 4, 'Bachelors', CURRENT_TIMESTAMP()),
(16, 'Daniel Lee', 6, 'World History', 10, 'Masters', CURRENT_TIMESTAMP()),
(17, 'Nicole Brown', 6, 'World History', 14, 'Masters', CURRENT_TIMESTAMP()),
(18, 'Steven Garcia', 6, 'World History', 7, 'Bachelors', CURRENT_TIMESTAMP()),

-- Chicago Teachers (Schools 7-9)
(19, 'Emily Anderson', 7, 'World History', 11, 'Masters', CURRENT_TIMESTAMP()),
(20, 'Matthew Taylor', 7, 'World History', 9, 'Masters', CURRENT_TIMESTAMP()),
(21, 'Ashley Miller', 7, 'World History', 6, 'Bachelors', CURRENT_TIMESTAMP()),
(22, 'Brian Jackson', 8, 'World History', 15, 'Doctorate', CURRENT_TIMESTAMP()),
(23, 'Samantha White', 8, 'World History', 8, 'Masters', CURRENT_TIMESTAMP()),
(24, 'Christopher Moore', 8, 'World History', 12, 'Masters', CURRENT_TIMESTAMP()),
(25, 'Jessica Clark', 9, 'World History', 5, 'Bachelors', CURRENT_TIMESTAMP()),
(26, 'Ryan Lewis', 9, 'World History', 13, 'Masters', CURRENT_TIMESTAMP()),
(27, 'Lauren Adams', 9, 'World History', 10, 'Masters', CURRENT_TIMESTAMP()),

-- Houston Teachers (Schools 10-12)
(28, 'Mark Turner', 10, 'World History', 14, 'Masters', CURRENT_TIMESTAMP()),
(29, 'Stephanie Phillips', 10, 'World History', 7, 'Bachelors', CURRENT_TIMESTAMP()),
(30, 'Joseph Campbell', 10, 'World History', 11, 'Masters', CURRENT_TIMESTAMP()),
(31, 'Melissa Parker', 11, 'World History', 9, 'Masters', CURRENT_TIMESTAMP()),
(32, 'William Evans', 11, 'World History', 16, 'Doctorate', CURRENT_TIMESTAMP()),
(33, 'Kimberly Scott', 11, 'World History', 6, 'Bachelors', CURRENT_TIMESTAMP()),
(34, 'Thomas Roberts', 12, 'World History', 12, 'Masters', CURRENT_TIMESTAMP()),
(35, 'Heather Carter', 12, 'World History', 8, 'Masters', CURRENT_TIMESTAMP()),
(36, 'Jason Mitchell', 12, 'World History', 10, 'Masters', CURRENT_TIMESTAMP()),

-- Phoenix Teachers (Schools 13-15)
(37, 'Andrea Perez', 13, 'World History', 13, 'Masters', CURRENT_TIMESTAMP()),
(38, 'Gregory Hall', 13, 'World History', 5, 'Bachelors', CURRENT_TIMESTAMP()),
(39, 'Vanessa Young', 13, 'World History', 15, 'Doctorate', CURRENT_TIMESTAMP()),
(40, 'Scott Hernandez', 14, 'World History', 9, 'Masters', CURRENT_TIMESTAMP()),
(41, 'Brittany King', 14, 'World History', 7, 'Bachelors', CURRENT_TIMESTAMP()),
(42, 'Nathan Wright', 14, 'World History', 14, 'Masters', CURRENT_TIMESTAMP()),
(43, 'Crystal Lopez', 15, 'World History', 11, 'Masters', CURRENT_TIMESTAMP()),
(44, 'Derek Hill', 15, 'World History', 6, 'Bachelors', CURRENT_TIMESTAMP()),
(45, 'Tiffany Green', 15, 'World History', 12, 'Masters', CURRENT_TIMESTAMP());

-- Insert Classes Data (3 world history classes per school, 1 per teacher)
INSERT INTO classes VALUES
-- NYC Classes (Schools 1-3)
(1, 'World History Period 1', 1, 1, 1, 'A101', 30, CURRENT_TIMESTAMP()),
(2, 'World History Period 3', 2, 1, 3, 'A102', 30, CURRENT_TIMESTAMP()),
(3, 'World History Period 5', 3, 1, 5, 'A103', 30, CURRENT_TIMESTAMP()),
(4, 'World History Period 2', 4, 2, 2, 'B201', 30, CURRENT_TIMESTAMP()),
(5, 'World History Period 4', 5, 2, 4, 'B202', 30, CURRENT_TIMESTAMP()),
(6, 'World History Period 6', 6, 2, 6, 'B203', 30, CURRENT_TIMESTAMP()),
(7, 'World History Period 1', 7, 3, 1, 'C301', 30, CURRENT_TIMESTAMP()),
(8, 'World History Period 3', 8, 3, 3, 'C302', 30, CURRENT_TIMESTAMP()),
(9, 'World History Period 5', 9, 3, 5, 'C303', 30, CURRENT_TIMESTAMP()),

-- LA Classes (Schools 4-6)
(10, 'World History Period 2', 10, 4, 2, 'D401', 30, CURRENT_TIMESTAMP()),
(11, 'World History Period 4', 11, 4, 4, 'D402', 30, CURRENT_TIMESTAMP()),
(12, 'World History Period 6', 12, 4, 6, 'D403', 30, CURRENT_TIMESTAMP()),
(13, 'World History Period 1', 13, 5, 1, 'E501', 30, CURRENT_TIMESTAMP()),
(14, 'World History Period 3', 14, 5, 3, 'E502', 30, CURRENT_TIMESTAMP()),
(15, 'World History Period 5', 15, 5, 5, 'E503', 30, CURRENT_TIMESTAMP()),
(16, 'World History Period 2', 16, 6, 2, 'F601', 30, CURRENT_TIMESTAMP()),
(17, 'World History Period 4', 17, 6, 4, 'F602', 30, CURRENT_TIMESTAMP()),
(18, 'World History Period 6', 18, 6, 6, 'F603', 30, CURRENT_TIMESTAMP()),

-- Chicago Classes (Schools 7-9)
(19, 'World History Period 1', 19, 7, 1, 'G701', 30, CURRENT_TIMESTAMP()),
(20, 'World History Period 3', 20, 7, 3, 'G702', 30, CURRENT_TIMESTAMP()),
(21, 'World History Period 5', 21, 7, 5, 'G703', 30, CURRENT_TIMESTAMP()),
(22, 'World History Period 2', 22, 8, 2, 'H801', 30, CURRENT_TIMESTAMP()),
(23, 'World History Period 4', 23, 8, 4, 'H802', 30, CURRENT_TIMESTAMP()),
(24, 'World History Period 6', 24, 8, 6, 'H803', 30, CURRENT_TIMESTAMP()),
(25, 'World History Period 1', 25, 9, 1, 'I901', 30, CURRENT_TIMESTAMP()),
(26, 'World History Period 3', 26, 9, 3, 'I902', 30, CURRENT_TIMESTAMP()),
(27, 'World History Period 5', 27, 9, 5, 'I903', 30, CURRENT_TIMESTAMP()),

-- Houston Classes (Schools 10-12)
(28, 'World History Period 2', 28, 10, 2, 'J1001', 30, CURRENT_TIMESTAMP()),
(29, 'World History Period 4', 29, 10, 4, 'J1002', 30, CURRENT_TIMESTAMP()),
(30, 'World History Period 6', 30, 10, 6, 'J1003', 30, CURRENT_TIMESTAMP()),
(31, 'World History Period 1', 31, 11, 1, 'K1101', 30, CURRENT_TIMESTAMP()),
(32, 'World History Period 3', 32, 11, 3, 'K1102', 30, CURRENT_TIMESTAMP()),
(33, 'World History Period 5', 33, 11, 5, 'K1103', 30, CURRENT_TIMESTAMP()),
(34, 'World History Period 2', 34, 12, 2, 'L1201', 30, CURRENT_TIMESTAMP()),
(35, 'World History Period 4', 35, 12, 4, 'L1202', 30, CURRENT_TIMESTAMP()),
(36, 'World History Period 6', 36, 12, 6, 'L1203', 30, CURRENT_TIMESTAMP()),

-- Phoenix Classes (Schools 13-15)
(37, 'World History Period 1', 37, 13, 1, 'M1301', 30, CURRENT_TIMESTAMP()),
(38, 'World History Period 3', 38, 13, 3, 'M1302', 30, CURRENT_TIMESTAMP()),
(39, 'World History Period 5', 39, 13, 5, 'M1303', 30, CURRENT_TIMESTAMP()),
(40, 'World History Period 2', 40, 14, 2, 'N1401', 30, CURRENT_TIMESTAMP()),
(41, 'World History Period 4', 41, 14, 4, 'N1402', 30, CURRENT_TIMESTAMP()),
(42, 'World History Period 6', 42, 14, 6, 'N1403', 30, CURRENT_TIMESTAMP()),
(43, 'World History Period 1', 43, 15, 1, 'O1501', 30, CURRENT_TIMESTAMP()),
(44, 'World History Period 3', 44, 15, 3, 'O1502', 30, CURRENT_TIMESTAMP()),
(45, 'World History Period 5', 45, 15, 5, 'O1503', 30, CURRENT_TIMESTAMP());

In [ ]:

-- =====================================================================================
-- GENERATE STUDENT DATA 
-- Note: This is a partial sample - the full dataset would have 30 students per class
-- =====================================================================================

-- Generate all 1,350 students with systematic unique naming pattern
-- 45 classes Ã— 30 students per class = 1,350 total students

INSERT INTO students (student_id, student_name, class_id, grade_level, age, gender, enrollment_date, created_at)
WITH student_generator AS (
    SELECT 
        c.class_id,
        sd.district_id,
        hs.school_id,
        ROW_NUMBER() OVER (ORDER BY c.class_id) as class_seq,
        sd.district_name,
        hs.school_name
    FROM classes c
    JOIN high_schools hs ON c.school_id = hs.school_id
    JOIN school_districts sd ON hs.district_id = sd.district_id
),
student_numbers AS (
    SELECT 
        SEQ4() as student_seq
    FROM TABLE(GENERATOR(ROWCOUNT => 30))
),
all_students AS (
    SELECT 
        ROW_NUMBER() OVER (ORDER BY sg.class_id, sn.student_seq) as student_id,
        'Student_' || ROW_NUMBER() OVER (ORDER BY sg.class_id, sn.student_seq) || 
        '_D' || sg.district_id || 
        '_S' || sg.school_id || 
        '_C' || sg.class_id as student_name,
        sg.class_id,
        CASE WHEN UNIFORM(1,4,RANDOM()) = 1 THEN 9
             WHEN UNIFORM(1,4,RANDOM()) = 2 THEN 10  
             WHEN UNIFORM(1,4,RANDOM()) = 3 THEN 11
             ELSE 12 END as grade_level,
        CASE WHEN UNIFORM(1,5,RANDOM()) = 1 THEN 14
             WHEN UNIFORM(1,5,RANDOM()) = 2 THEN 15
             WHEN UNIFORM(1,5,RANDOM()) = 3 THEN 16
             WHEN UNIFORM(1,5,RANDOM()) = 4 THEN 17
             ELSE 18 END as age,
        CASE WHEN UNIFORM(1,2,RANDOM()) = 1 THEN 'Male' ELSE 'Female' END as gender,
        '2024-09-01'::DATE as enrollment_date
    FROM student_generator sg
    CROSS JOIN student_numbers sn
)
SELECT 
    student_id,
    student_name, 
    class_id,
    grade_level,
    age,
    gender,
    enrollment_date,
    CURRENT_TIMESTAMP()
FROM all_students;

In [ ]:

-- =====================================================================================
-- CREATE DENORMALIZED VIEW
-- Single view that joins all tables to show complete student hierarchy
-- =====================================================================================

CREATE OR REPLACE VIEW student_school_complete_vw AS
SELECT 
    -- Student Information
    s.student_id,
    s.student_name,
    s.grade_level,
    s.age,
    s.gender,
    s.enrollment_date,
    
    -- Class Information
    c.class_id,
    c.class_name,
    c.period,
    c.room_number,
    c.max_capacity,
    
    -- Teacher Information  
    t.teacher_id,
    t.teacher_name,
    t.subject,
    t.years_experience,
    t.education_level,
    
    -- School Information
    hs.school_id,
    hs.school_name,
    hs.school_type,
    hs.enrollment AS school_enrollment,
    
    -- District Information
    sd.district_id,
    sd.district_name,
    sd.total_students AS district_total_students,
    sd.total_schools AS district_total_schools,
    
    -- City Information
    ct.city_id,
    ct.city_name,
    ct.state,
    ct.population AS city_population
    
FROM students s
JOIN classes c ON s.class_id = c.class_id
JOIN teachers t ON c.teacher_id = t.teacher_id
JOIN high_schools hs ON c.school_id = hs.school_id
JOIN school_districts sd ON hs.district_id = sd.district_id
JOIN cities ct ON sd.city_id = ct.city_id;

In [ ]:
--drop table student_question_responses;

In [ ]:
CREATE TABLE IF NOT EXISTS WORLD_HISTORY_TEST_QUESTIONS (
    QUESTION_ID NUMBER AUTOINCREMENT PRIMARY KEY,
    FILEPATH STRING,
    CHAPTER_NUMBER NUMBER,
    PAGE_NUMBER NUMBER,
    QUESTION_NUMBER NUMBER,
    QUESTION_TEXT STRING,
    OPTION_A STRING,
    OPTION_B STRING,
    OPTION_C STRING,
    OPTION_D STRING,
    CORRECT_ANSWER STRING,
    DIFFICULTY_LEVEL STRING,
    TOPIC STRING,
    CREATED_TIMESTAMP TIMESTAMP DEFAULT CURRENT_TIMESTAMP()
);

CREATE TABLE IF NOT EXISTS TEST_SCHEDULE (
    SCHEDULE_ID NUMBER AUTOINCREMENT,
    CLASS_ID NUMBER,
    TEACHER_ID NUMBER,
    SCHOOL_ID NUMBER,
    CHAPTER_NUMBER NUMBER,
    TEST_ID NUMBER, -- Will link to CHAPTER_TESTS when tests are generated
    SCHEDULED_DATE DATE,
    SCHEDULED_WEEK NUMBER, -- Week number of academic year (1-40)
    ACADEMIC_YEAR VARCHAR(20) DEFAULT '2024-2025',
    TEST_STATUS VARCHAR(20) DEFAULT 'SCHEDULED',
    CREATED_TIMESTAMP TIMESTAMP_NTZ DEFAULT CURRENT_TIMESTAMP()
);

CREATE TABLE IF NOT EXISTS STUDENT_QUESTION_RESPONSES (
    RESPONSE_ID INTEGER AUTOINCREMENT PRIMARY KEY,
    TEST_RESULT_ID INTEGER,
    QUESTION_ID INTEGER,
    STUDENT_ID INTEGER,
    STUDENT_ANSWER CHAR(1),
    CORRECT_ANSWER CHAR(1),
    IS_CORRECT BOOLEAN,
    RESPONSE_TIME_SECONDS INTEGER,
    CHAPTER_NUMBER INTEGER,
    DIFFICULTY_LEVEL VARCHAR(20),
    TOPIC VARCHAR(200),
    CREATED_AT TIMESTAMP DEFAULT CURRENT_TIMESTAMP()
);

CREATE DYNAMIC TABLE IF NOT EXISTS STUDENT_CHAPTER_TEST_RESULTS 
   TARGET_LAG = '10 minutes'
   WAREHOUSE = WAREHOUSE_XL_G2
AS
    SELECT
        STUDENT_ID,
        CHAPTER_NUMBER,
        COUNT(*) AS total_questions,
        SUM(IFF(r.IS_CORRECT, 1, 0)) as correct_answers,
        (correct_answers / total_questions) * 100 AS final_score_percent,
        CASE 
        WHEN GREATEST(65, final_score_percent) >= 97 THEN 'A+'
        WHEN GREATEST(65, final_score_percent) >= 93 THEN 'A'
        WHEN GREATEST(65, final_score_percent) >= 90 THEN 'A-'
        WHEN GREATEST(65, final_score_percent) >= 87 THEN 'B+'
        WHEN GREATEST(65, final_score_percent) >= 83 THEN 'B'
        WHEN GREATEST(65, final_score_percent) >= 80 THEN 'B-'
        WHEN GREATEST(65, final_score_percent) >= 77 THEN 'C+'
        WHEN GREATEST(65, final_score_percent) >= 73 THEN 'C'
        WHEN GREATEST(65, final_score_percent) >= 70 THEN 'C-'
        WHEN GREATEST(65, final_score_percent) >= 67 THEN 'D+'
        WHEN GREATEST(65, final_score_percent) >= 65 THEN 'D'
        ELSE 'F'
    END as LETTER_GRADE
    FROM
        WORLD_HISTORY.SCHOOLS.STUDENT_QUESTION_RESPONSES r
    GROUP BY
        1, 2
    ORDER BY
        STUDENT_ID, CHAPTER_NUMBER;

In [ ]:
--drop dynamic table student_chapter_test_results;

In [ ]:
CREATE OR REPLACE TEMPORARY TABLE academic_calendar AS
WITH date_series AS (
    SELECT 
        DATEADD(WEEK, ROW_NUMBER() OVER (ORDER BY NULL) - 1, '2025-08-05'::DATE) as week_start_date,
        ROW_NUMBER() OVER (ORDER BY NULL) as week_number
    FROM TABLE(GENERATOR(ROWCOUNT => 45)) -- Generate 45 weeks to cover full academic year
),
academic_weeks AS (
    SELECT 
        week_start_date,
        week_number,
        MONTH(week_start_date) as month_num,
        CASE 
            WHEN week_start_date BETWEEN '2024-12-23' AND '2025-01-06' THEN 'Winter Break'
            WHEN week_start_date BETWEEN '2025-03-10' AND '2025-03-17' THEN 'Spring Break'
            WHEN week_start_date BETWEEN '2025-11-25' AND '2025-11-29' THEN 'Thanksgiving Break'
            WHEN DAYOFWEEK(week_start_date) IN (1, 7) THEN 'Weekend'
            ELSE 'Regular School Week'
        END as week_type
    FROM date_series
    WHERE week_start_date <= '2026-06-15' -- End of academic year
)
SELECT 
    week_number,
    week_start_date,
    week_type,
    -- Adjust to use school days (Tuesday-Thursday for testing)
    DATEADD(DAY, 2, week_start_date) as suggested_test_date -- Wednesday of each week
FROM academic_weeks
WHERE week_type = 'Regular School Week'
ORDER BY week_number;

-- Show academic calendar
SELECT 
    week_number,
    week_start_date,
    suggested_test_date,
    week_type
FROM academic_calendar
LIMIT 40;


INSERT INTO TEST_SCHEDULE (
    CLASS_ID, TEACHER_ID, SCHOOL_ID, CHAPTER_NUMBER, 
    SCHEDULED_DATE, SCHEDULED_WEEK
)
WITH all_classes AS (
    SELECT 
        c.CLASS_ID,
        c.TEACHER_ID,
        c.SCHOOL_ID
    FROM CLASSES c
),
chapter_sequence AS (
    SELECT 
        ROW_NUMBER() OVER (ORDER BY NULL) as chapter_number
    FROM TABLE(GENERATOR(ROWCOUNT => 32)) -- 32 chapters
),
class_schedules AS (
    SELECT 
        ac.CLASS_ID,
        ac.TEACHER_ID,
        ac.SCHOOL_ID,
        cs.chapter_number,
        -- Randomly assign starting week for each class, then sequential weekly spacing
        LEAST(40, GREATEST(1, 
            (HASH(ac.CLASS_ID, ac.TEACHER_ID) % 8) + 1 + (cs.chapter_number - 1)
        )) as assigned_week
    FROM all_classes ac
    CROSS JOIN chapter_sequence cs
),
scheduled_tests AS (
    SELECT 
        cls.CLASS_ID,
        cls.TEACHER_ID,
        cls.SCHOOL_ID,
        cls.chapter_number,
        cls.assigned_week,
        COALESCE(cal.suggested_test_date, 
                DATEADD(WEEK, cls.assigned_week - 1, '2024-08-07')
        ) as scheduled_date
    FROM class_schedules cls
    LEFT JOIN academic_calendar cal ON cls.assigned_week = cal.week_number
    WHERE cls.assigned_week <= 40 -- Ensure we don't exceed academic year
)
SELECT 
    CLASS_ID,
    TEACHER_ID,
    SCHOOL_ID,
    chapter_number,
    scheduled_date,
    assigned_week
FROM scheduled_tests
WHERE scheduled_date IS NOT NULL;

In [ ]:
CREATE OR REPLACE FUNCTION extract_all_numbered_items(staged_file_path STRING)
RETURNS STRING
LANGUAGE PYTHON
RUNTIME_VERSION = '3.12'
PACKAGES = ('snowflake-snowpark-python', 'pypdf')
HANDLER = 'extract_text'
AS $$
import re
import json
from pypdf import PdfReader
from snowflake.snowpark.files import SnowflakeFile

def extract_text(staged_file_path: str) -> str:
    try:
        with SnowflakeFile.open(staged_file_path, 'rb') as f:
            reader = PdfReader(f)
            # Join pages with a newline to help regex anchors
            full_text = "\n".join(page.extract_text() or "" for page in reader.pages)
        
        # Use a simpler, more forgiving regex.
        # It finds a number at the start of a line, captures it,
        # and then captures all following text until the next numbered line or the end of the file.
        # This is much more robust against formatting issues.
        found_items = re.findall(r"^(\d+)\.\s(.*?)(?=\n\d+\.\s|\Z)", full_text, re.DOTALL | re.MULTILINE)
        
        # Simply format whatever is found into JSON. No more filtering here.
        items_list = [{"number": int(num), "text": text.strip()} for num, text in found_items]
        
        return json.dumps(items_list)

    except Exception:
        # Return an empty JSON array on error to prevent downstream query failure.
        return '[]'
$$;

In [ ]:
CREATE OR REPLACE FUNCTION WORLD_HISTORY.SCHOOLS.EXTRACT_QUESTIONS("STAGED_FILE_PATH" VARCHAR)
RETURNS VARCHAR
LANGUAGE PYTHON
RUNTIME_VERSION = '3.12'
PACKAGES = ('snowflake-snowpark-python','pypdf')
HANDLER = 'extract_questions'
AS '
import re
import json
from pypdf import PdfReader
from snowflake.snowpark.files import SnowflakeFile

def extract_questions(staged_file_path: str) -> str:
    """
    Extracts numbered questions from a PDF file stored in a Snowflake stage.

    Args:
        staged_file_path: The path to the PDF file within a Snowflake stage.

    Returns:
        A JSON string representing a list of question objects,
        each with a ''number'' and ''text'' key.
    """
    try:
        with SnowflakeFile.open(staged_file_path, ''rb'') as f:
            reader = PdfReader(f)
            full_text = "".join(page.extract_text() or "" for page in reader.pages)
        
        # Modified regex:
        # (\\d+)      - Capturing group 1: one or more digits (the question number).
        # \\.\\s       - A literal period followed by a space.
        # (.*?)      - Capturing group 2: the question text (non-greedy).
        # (?=...)    - Positive lookahead to stop at the next number or end of string.
        found_questions = re.findall(r"(\\d+)\\.\\s(.*?)(?=\\d+\\.\\s|\\Z)", full_text, re.DOTALL)
        
        # Format the list of tuples [(''1'', ''text...''), (''2'', ''text...'')] into a list of dicts.
        questions_list = [
            {"number": int(number), "text": text.strip()}
            for number, text in found_questions
        ]
        
        # Return the list as a JSON string.
        return json.dumps(questions_list)

    except Exception as e:
        return f"Error processing file: {staged_file_path}. Details: {str(e)}"
';

In [ ]:
WITH test_assessment_start_page AS (
  SELECT
    page_id,
    chapter_number,
    page_number
  FROM
    world_history.public.world_history_rag
  WHERE
    content_type = 'RawText' AND page_number IS NOT NULL AND text_content iLIKE '%STANDARDIZED TEST PRACTICE%' 
    -- and chapter_number like 23
    -- limit 5
), 
ASSESSMENT_PAGES AS (
    SELECT
      f.value :: STRING AS file_path,
      chapter_number,
      page_number
    FROM
      test_assessment_start_page,
      LATERAL FLATTEN(
        input => ARRAY_CONSTRUCT(
          '/pages/chap' || LPAD(chapter_number, 2, '0') || '_page' || LPAD(page_number, 4, '0') || '.pdf',
          '/pages/chap' || LPAD(chapter_number, 2, '0') || '_page' || LPAD(page_number + 1, 4, '0') || '.pdf',
          '/pages/chap' || LPAD(chapter_number, 2, '0') || '_page' || LPAD(page_number + 2, 4, '0') || '.pdf'
        )
      ) f
)

select 
    ap.file_path,
    extract_questions(BUILD_SCOPED_FILE_URL(@world_history.public.pdf_documents, ap.file_path)) as extracted_questions,
    ap.chapter_number,
    ap.page_number
FROM
    assessment_pages ap
GROUP BY
    1, 3, 4;

In [ ]:
SELECT
        eqc.file_path,
        eqc.page_number,
        eqc.chapter_number,
        f.value:number::INT % 100 AS question_number,
        f.value:text::STRING AS question_text
    FROM
        {{extract_test_questions}} eqc,
        LATERAL FLATTEN(input => PARSE_JSON(eqc.extracted_questions)) f
    WHERE
        -- This WHERE clause is now the main filter for finding MCQs.
        -- It's more robust to do this here than in the Python UDF.
        -- Using LIKE without periods is slightly more forgiving.
        question_text LIKE '%A %'
        AND question_text LIKE '%B %'
        AND question_text LIKE '%C %'
        AND question_text LIKE '%D %'

In [ ]:

SELECT
    ctq.*,
       try_parse_json(AI_COMPLETE(
        'mixtral-8x7b',
        'You are formatting test questions that have been extracted from a World History textbook page. 
        
        TASK: Extract ALL multiple choice test questions from this textbook page, format it properly and supply the right answer.
        
        REQUIREMENTS:
        1. Extract ONLY multiple choice questions (ignore essay, short answer, fill-in-the-blank)
        2. Each question must have exactly 4 answer choices (A, B, C, D)
        3. If the correct answer is provided, include it; if not, research the answer to find it.  Do not leave an answer blank or null.  If you cannot find an answer put "C"
        4. Extract the topic/concept being tested based on other questions in the input.
        5. Return results in this EXACT JSON format:
        
        {
          "extracted_questions": [
            {
              "question_text": "Which type of scientist uses fossils and artifacts to study early humans?",
              "option_a": "Chemists",
              "option_b": "Physicists", 
              "option_c": "Anthropologists",
              "option_d": "Geologists",
              "correct_answer": "C",
              "topic": "Early Human Study",
              "difficulty_level": "Medium"
            }
          ],
          "extraction_notes": "Found X questions on page",
          "page_info": {
            "chapter_number": ' || ctq.chapter_number || ',
            "page_number": ' || ctq.page_number || ',
            "contains_test_questions": true
          }
        }
        
        IMPORTANT RULES:
        - Return ONLY valid JSON, no other text
        - Use "Easy", "Medium", or "Hard" for difficulty_level
        - If no test questions found, return empty array for extracted_questions
        - If questions are incomplete or don\'t have 4 options, skip them
        - If any answers are more than one choice (eg "C, D"), skip them.  
        - Extract the question text exactly as written, EXCEPT extract the specific options to the option_a, option_b, option_c or option_d field. Do NOT include the letter for the option in the value field. Ie if two of the potential anwsners are "A Conscription\nB War communism\n" then the JSON should only include the word that would fill in the blank => {"option_a": "Conscription", "option_b": "War communism"} 
        - If there is a fill in the blank (missing word), replace the empty space with "_____".

        EXAMPLE:
        INPUT TEXT: "is the process of assembling troops and supplies to \nget ready for war. \nA Conscription\nB War communism\nC Armistice\nD Mobilization\n"
        DESIRED OUTPUT:
            {
              "correct_answer": "D",
              "difficulty_level": "Easy",
              "option_a": "Conscription",
              "option_b": "War communism",
              "option_c": "Armistice",
              "option_d": "Mobilization",
              "question_number": 3,
              "question_text": "_____ is the process of assembling troops and supplies to get ready for war.",
              "topic": "War Preparation"
            },
        
        PAGE CONTENT:
        ' || ctq.question_text
    )) AS extraction_result
FROM {{chunk_test_questions}} ctq

In [ ]:
--delete from world_history_test_questions;

In [ ]:
INSERT INTO WORLD_HISTORY_TEST_QUESTIONS(
    FILEPATH,
    CHAPTER_NUMBER,
    PAGE_NUMBER,
    QUESTION_NUMBER,
    QUESTION_TEXT,
    OPTION_A,
    OPTION_B,
    OPTION_C,
    OPTION_D,
    CORRECT_ANSWER,
    DIFFICULTY_LEVEL,
    TOPIC
)

SELECT
 ptq.file_path,
 ptq.chapter_number,
 ptq.page_number,
 ptq.question_number,
 f.value:question_text as question_text,
 f.value:option_a as option_a,
 f.value:option_b as option_b,
 f.value:option_c as option_c,
 f.value:option_d as option_d,
 coalesce(f.value:correct_answer, 'C') as correct_answer,
 f.value:difficulty_level as difficulty_level,
 f.value:topic as topic,
FROM {{parse_test_questions}} ptq,
   LATERAL FLATTEN(input => ptq.extraction_result:extracted_questions) f

In [ ]:
delete from student_question_responses;

In [ ]:
-- This single INSERT statement generates and inserts all the mock student responses.
-- It is designed to work with your table where RESPONSE_ID is AUTOINCREMENT
-- and CREATED_AT has a DEFAULT value.

INSERT INTO WORLD_HISTORY.SCHOOLS.STUDENT_QUESTION_RESPONSES (
    TEST_RESULT_ID,
    QUESTION_ID,
    STUDENT_ID,
    STUDENT_ANSWER,
    CORRECT_ANSWER,
    IS_CORRECT,
    RESPONSE_TIME_SECONDS,
    CHAPTER_NUMBER,
    DIFFICULTY_LEVEL,
    TOPIC
)
WITH
-- CTE 1: Get a distinct list of all chapters that have questions.
ALL_CHAPTERS AS (
    SELECT DISTINCT CHAPTER_NUMBER
    FROM WORLD_HISTORY.SCHOOLS.WORLD_HISTORY_TEST_QUESTIONS
),

-- CTE 2: Assign a target score (65-100) for each student for each chapter.
TARGET_SCORES AS (
    SELECT
        s.STUDENT_ID,
        c.CHAPTER_NUMBER,
        -- Generate a score from a normal distribution with mean=82.5, stddev=5
        -- and clamp the result between 65 and 100.
        LEAST(100.0, GREATEST(65.0, NORMAL(82.5, 5, RANDOM()))) AS TARGET_PERCENT_CORRECT
    FROM
        WORLD_HISTORY.SCHOOLS.STUDENTS s
    CROSS JOIN
        ALL_CHAPTERS c
),

-- CTE 3: Get all questions for each chapter and find the total question count.
CHAPTER_QUESTIONS AS (
    SELECT
        CHAPTER_NUMBER,
        QUESTION_ID,
        CORRECT_ANSWER,
        DIFFICULTY_LEVEL,
        TOPIC,
        COUNT(QUESTION_ID) OVER (PARTITION BY CHAPTER_NUMBER) AS TOTAL_QUESTIONS_IN_CHAPTER
    FROM
        WORLD_HISTORY.SCHOOLS.WORLD_HISTORY_TEST_QUESTIONS
),

-- CTE 4: Combine scores and questions, then randomly rank questions for each student's test.
FINAL_RESPONSES AS (
    SELECT
        ts.STUDENT_ID,
        cq.QUESTION_ID,
        cq.CHAPTER_NUMBER,
        cq.CORRECT_ANSWER,
        cq.DIFFICULTY_LEVEL,
        cq.TOPIC,
        -- Assign a random rank to each question within a student's chapter test attempt
        ROW_NUMBER() OVER (PARTITION BY ts.STUDENT_ID, ts.CHAPTER_NUMBER ORDER BY UNIFORM(0,1,RANDOM())) as random_rank,
        -- Calculate the exact number of questions that should be correct based on the target score
        ROUND(cq.TOTAL_QUESTIONS_IN_CHAPTER * ts.TARGET_PERCENT_CORRECT / 100) AS num_to_be_correct
    FROM
        TARGET_SCORES ts
    JOIN
        CHAPTER_QUESTIONS cq ON ts.CHAPTER_NUMBER = cq.CHAPTER_NUMBER
)

-- Final SELECT to format and insert the data
SELECT
    NULL AS TEST_RESULT_ID, -- Populated with NULL as it's a separate entity
    fr.QUESTION_ID,
    fr.STUDENT_ID,
    -- If the answer is correct, student_answer is the correct answer. Otherwise, NULL.
    IFF((fr.random_rank <= fr.num_to_be_correct), fr.CORRECT_ANSWER, NULL) AS STUDENT_ANSWER,
    fr.CORRECT_ANSWER,
    (fr.random_rank <= fr.num_to_be_correct) AS IS_CORRECT,
    UNIFORM(15, 90, RANDOM()) AS RESPONSE_TIME_SECONDS, -- Random response time: 15-90s
    fr.CHAPTER_NUMBER,
    fr.DIFFICULTY_LEVEL,
    fr.TOPIC
FROM
    FINAL_RESPONSES fr;

In [ ]:
UPDATE
  STUDENT_QUESTION_RESPONSES
SET CORRECT_ANSWER = UPPER(CORRECT_ANSWER);

UPDATE
  STUDENT_QUESTION_RESPONSES
SET
  STUDENT_ANSWER = CASE UPPER(CORRECT_ANSWER)
    WHEN 'A' THEN (
      SELECT VALUE FROM TABLE(FLATTEN(INPUT => ['B', 'C', 'D']::ARRAY)) ORDER BY RANDOM() LIMIT 1
    )
    WHEN 'B' THEN (
      SELECT VALUE FROM TABLE(FLATTEN(INPUT => ['A', 'C', 'D']::ARRAY)) ORDER BY RANDOM() LIMIT 1
    )
    WHEN 'C' THEN (
      SELECT VALUE FROM TABLE(FLATTEN(INPUT => ['A', 'B', 'D']::ARRAY)) ORDER BY RANDOM() LIMIT 1
    )
    WHEN 'D' THEN (
      SELECT VALUE FROM TABLE(FLATTEN(INPUT => ['A', 'B', 'C']::ARRAY)) ORDER BY RANDOM() LIMIT 1
    )
  END
  WHERE
  STUDENT_ANSWER IS NULL or STUDENT_ANSWER = '';

In [ ]:
-- test correct answer distribution
SELECT
    RESPONSE_ID,
    CORRECT_ANSWER,
    STUDENT_ANSWER
FROM
    WORLD_HISTORY.SCHOOLS.STUDENT_QUESTION_RESPONSES r
WHERE STUDENT_ANSWER is null
limit 10;

# Upload Semantic Model

In [ ]:
CREATE OR REPLACE STAGE WORLD_HISTORY.PUBLIC.CONFIG_FILES
    ENCRYPTION = (TYPE = 'SNOWFLAKE_SSE')
    DIRECTORY = (ENABLE = TRUE);

In [ ]:
session = get_active_session()

# 1. Define the path to your YAML file
local_file_path = "world_history_analytics.yaml"

# 2. Define the target stage
target_stage = "@WORLD_HISTORY.PUBLIC.CONFIG_FILES"

# 3. Use the put command to upload the file
put_result = session.file.put(local_file_path, target_stage, auto_compress= False, overwrite=True)

# Print the result to confirm the upload
print(f"File uploaded successfully: {put_result[0].target} {put_result[0].status}")